/*
Имеется файл, в каждой строке которого хранится запись о проданном авто.
Необходимо вывести на экран информацию о самом дорогом проданном авто,
год выпуска которого не старше заданного.
*/

#pragma once
//. по-строчная вычитка из файла по условию (год выпуска <= заданный год)
//см. тут http://www.cplusplus.com/forum/beginner/208388/#msg982326
//. запись считанной строки в несортированную динамическую структуру-контейнер
//см. stl контейнеры http://informatics.mccme.ru/mod/book/view.php?id=492&chapterid=200
//. сортировка динамических контейнеров http://www.cplusplus.com/articles/NhA0RXSz/ 
